import random

def гра_камінь_ножиці_папір():
    варіанти = ["камінь", "ножиці", "папір"]
    
    вибір_користувача = input("Введіть камінь, ножиці або папір: ").lower()
    
    вибір_компютера = random.choice(варіанти)
    
    print("Комп'ютер обрав: " + вибір_компютера)
    
    # Визначення переможця
    if вибір_користувача in варіанти:
        if вибір_користувача == вибір_компютера:
            return "Нічия!"
        elif (вибір_користувача == "камінь" and вибір_компютера == "ножиці") or \
             (вибір_користувача == "ножиці" and вибір_компютера == "папір") or \
             (вибір_користувача == "папір" and вибір_компютера == "камінь"):
            return "Ви виграли!"
        else:
            return "Комп'ютер виграв!"
    else:
        return "Неправильний ввід. Будь ласка, введіть камінь, ножиці або папір."

while True:
    результат = гра_камінь_ножиці_папір()
    print(результат)
    продовжити = input("Бажаєте зіграти ще раз? (так/ні): ").lower()
    if продовжити != 'так':
        break
